

&НаКлиенте
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(ПериодЗагрузки.ДатаНачала) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодЗагрузки.ДатаОкончания) Тогда
		ПоказатьПредупреждение(,"Не заполнена дата окончания!");
		Возврат;
	КонецЕсли;
	
	МассивВалют = КурсыВалютСервер.СформироватьМассивВалютДляЗагрузкиИзИнтернета();
	//@skip-warning
	Всего 		= МассивВалют.Количество();
	//@skip-warning
	Сч 			= 1;
	
	Для каждого Валюта из МассивВалют Цикл
//		#Если НЕ МобильныйКлиент Тогда
//		Состояние("Загружается курс валюты: " + Валюта, Сч * 100 / Всего);
//		#КонецЕсли	
		КурсыВалютСервер.ЗагрузитьКурсВалютыЗаПериод(ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания, Валюта);
	КонецЦикла;
	
	ПоказатьПредупреждение(,"Загрузка завершена");
	Оповестить("ЗагруженыКурсыВалют");
	Закрыть();
КонецПроцедуры


